# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [1]:
import pandas as pd

## Generate a Dataframe

```python
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()
```

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

<hr>
<br>
<br>

## Unique Values

```python
df['col2'].unique()
```

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

```python
df['col2'].nunique()
```

In [4]:
df['col2'].nunique()

3

```python
df['col2'].value_counts()
```

In [5]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [7]:
df['col2'].value_counts().index

Int64Index([444, 555, 666], dtype='int64')

In [10]:
df['col2'].value_counts().sort_index()

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
df['col2'].value_counts().values

array([2, 1, 1], dtype=int64)

In [9]:
df['col2'].value_counts().sort_values()

555    1
666    1
444    2
Name: col2, dtype: int64

<hr>
<br>
<br>

## Applying Functions

```python
def times2(x):
    return x*2
```

In [11]:
def times2(x):
    return x*2

```python
df['col1'].apply(times2)
```

In [12]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [15]:
times2(df['col1'])

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

```python
df['col3'].apply(len)
```

In [16]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

```python
df['col1'].sum()
```

In [18]:
df['col1'].sum()

10

<hr>
<br>
<br>

## Sorting and Ordering a DataFrame

```python
df
```

In [19]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

```python
df.sort_values(by='col2')
```

In [20]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [21]:
df.sort_values(by='col2').reset_index()

   index  col1  col2 col3
0      0     1   444  abc
1      3     4   444  xyz
2      1     2   555  def
3      2     3   666  ghi

In [23]:
df.sort_values(by='col2').reset_index(drop=True)

   col1  col2 col3
0     1   444  abc
1     4   444  xyz
2     2   555  def
3     3   666  ghi